; domain
(define (domain chasseAuxBananes)
    (:requirements :strips :typing)
    (:types animal - entite objet - entite position hauteur)
    (:predicates (situe ?x - entite ?y - position)
                 (niveau ?x - entite ?y - hauteur)
                 (possede ?x - animal ?y - objet)
                 (mainsVides)
    )
    (:constants singe - animal
                bananes - objet
                caisse - objet
                haut - hauteur
                bas - hauteur
                a - position
                b - position
                c - position
    )
    (:action seDeplace
        ;;; Le singe se déplace de l'emplacement ?x à l'emplacement ?y 
        :parameters (?x - position ?y - position)
        :precondition (and (situe singe ?x) (niveau singe bas))
        :effect (and (situe singe ?y)
                (not (situe singe ?x)))
    )
    (:action prend
        ;;; Le singe prend l'objet ?x (ne peut prendre qu'un objet à la fois)
        :parameters (?x - objet ?pos - position ?niv - hauteur)
        :precondition (and (situe singe ?pos) (situe ?x ?pos) (niveau singe ?niv) (niveau ?x ?niv) (mainsVides))
        :effect (and (possede singe ?x)
                (not (situe ?x ?pos))
                (not (niveau ?x ?niv))
                (not (mainsVides)))
    )
    (:action depose
        ;;; Le singe dépose l'objet ?x
        :parameters (?x - objet ?pos - position ?niv - hauteur)
        :precondition (and (possede singe ?x) (situe singe ?pos) (niveau singe ?niv))
        :effect (and (situe ?x ?pos)
                (niveau ?x ?niv)
                (mainsVides)
                (not (possede singe ?x)))
    )
    (:action monteCaisse
        ;;; Le singe monte sur la caisse
        :parameters (?pos - position)
        :precondition (and (situe singe ?pos) (situe caisse ?pos) (niveau singe bas) (niveau caisse bas))
        :effect (and (niveau singe haut)
                (not (niveau singe bas)))
    )
)

; problem
(define (problem chasseAuxBananesProblem)
    (:domain chasseAuxBananes)
    (:init  (situe singe a)
            (situe bananes b)
            (situe caisse c)
            (niveau singe bas)
            (niveau bananes haut)
            (niveau caisse bas)
            (mainsVides)
    )
    (:goal (possede singe bananes))
)

; plan
1. (sedeplace a c)
   deleted: (situe singe a)
   added: (situe singe c)
   goals met: 0 of 1
2. (prend caisse c bas)
   deleted: (situe caisse c) (niveau caisse bas) (mainsvides)
   added: (possede singe caisse)
   goals met: 0 of 1
3. (sedeplace c b)
   deleted: (situe singe c)
   added: (situe singe b)
   goals met: 0 of 1
4. (depose caisse b bas)
   deleted: (possede singe caisse)
   added: (situe caisse b) (niveau caisse bas) (mainsvides)
   goals met: 0 of 1
5. (montecaisse b)
   deleted: (niveau singe bas)
   added: (niveau singe haut)
   goals met: 0 of 1
6. (prend bananes b haut)
   deleted: (situe bananes b) (niveau bananes haut) (mainsvides)
   added: (possede singe bananes)
   goals met: 1 of 1
